Network Science/notes/network-notes.org
#+TITLE: Notes: Network Science
#+AUTHOR: Søren Post
#+Options: toc:nil
#+LATEX_HEADER: \setlength{\parskip}{1em} % set spaces between paragraphs to 1 character
#+LATEX_HEADER: \setlength{\parindent}{0em} % set indents for new paragraphs to 0
#+LATEX_HEADER: \usepackage{natbib}
#+LATEX_HEADER: \usepackage[a4paper, total={6in, 8in}]{geometry}

\newpage

* Introduction

- *Cascading failure:* Cascading failures = hvis et netwærk er et transport system (informationa, elektricitet, trafik) så vil en lokal failure betyde at "loaden" flytts til andre links. Hvs load er lille, så det ligegyldigt. Hvis load er for stor, så kan disse links også bryde sammen, og loaden der skal flyttes blivern u strre. Dette kan lede til at flere og flere links bryder sammen og at loaden bliver større og større, således at det samlede netværk bryder totalt sammen. Eksemler: DOS angreb å routere, IMF credit limits i pacific central banks 1997.
  
