Network Science/notes/network-notes.tex
% Created 2020-01-29 Wed 14:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\setlength{\parskip}{1em} % set spaces between paragraphs to 1 character
\setlength{\parindent}{0em} % set indents for new paragraphs to 0
\usepackage{natbib}
\usepackage[a4paper, total={6in, 8in}]{geometry}
\author{Søren Post}
\date{\today}
\title{Notes: Network Science}
\hypersetup{
 pdfauthor={Søren Post},
 pdftitle={Notes: Network Science},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.2.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\newpage

\section{Introduction}
\label{sec:orgaba2d05}

\begin{itemize}
\item \textbf{Cascading failure:} Cascading failures = hvis et netwærk er et transport system (informationa, elektricitet, trafik) så vil en lokal failure betyde at "loaden" flytts til andre links. Hvs load er lille, så det ligegyldigt. Hvis load er for stor, så kan disse links også bryde sammen, og loaden der skal flyttes blivern u strre. Dette kan lede til at flere og flere links bryder sammen og at loaden bliver større og større, således at det samlede netværk bryder totalt sammen. Eksemler: DOS angreb å routere, IMF credit limits i pacific central banks 1997.
\end{itemize}
