Network Science/notes/network-notes.org
* Graph Theory
- *Bridges of Koenigsberg:* "Kan man krydse alle broerne uden at krydse samme bro to gange?". Euler: Hvis der er en sti der ktrydser alle broer, og aldrig den samme, så må noder med ulige links være enten start eller slut. En sti kan kun have en start og en slut, så et system med mere en to noder med ulige antal links kan ikke ofylde kriterierne.

- Et netværk er et "catalog of a system's components": noder (vertices) og links (edges).

- *N* er antallet af noder. Er ofte referet til som "size of the network". Man adskiller noder ved i = 1, 2, ..., N.

- *L* er antallet af links mellem noderne. Er sjældent labelled, fordi de nemt referes til med hvilke noder til binder sammen (fx (1, 4) er et link mellem node 1 og node 4.

- *Directed vs Undirected:* et netværk er directed hvis alle links har en retning (fx URL'er) (hedder også en digraph). Det er undirected hvis ingen links har et retning (fx dating).

- *Degree* = det antal links en node gar til andre noder er "degree". For den i'ende node er degree $k_i$. For et undirected netwærk bruges $k_i$, for et directed netværk skelnes mellem $k^{in}_i$ og $k^{out}_i$.

- *Total links:* I et undirected network er antallet af links: $$ L = \frac{1}{2} \sum^N_{i = 1} k_i $$. Der ganges med en halv fordi alle links involvere to noder og derfor tælles dobbelt.

- *Brief stat review:*
  - Mean: $< x > = \frac{x_1 + x_2 + ... + x_N}{N} = \frac{1}{N} \sum^N_{i = 1} x_i$
  - n^{th} moment: $< x > = \frac{x^n_1 + x^n_2 + ... + x^n_N}{N} = \frac{1}{N} \sum^N_{i = 1} x^n_i$
  - Standard deviation: $\sigma_x = \sqrt{\frac{1}{N} \sum^N_{i = 1} (x_i - <x>)^2}$
  - Distributon of x: $p_x = \frac{1}{N} \delta_{x, x_i}$ hvor p_x følger $\sum_i p_x = 1 (\int_{p_x} dx = 1)$

- *Average degree:* er en vigtig egenskab for et netværk: $$ <k> = \frac{1}{N} \sum^N_{i = 1} = \frac{2L}{N} $$ og hvor $k_i = k^{in}_i + k^{out}_i$ og $L = \sum^N_{i = 1} k^{in}_i = \sum^N_{i = 1} k^{out}_i$ (fordi alle links starter et sted og stopper et sted.

- *Average degree for directed network:* er altså: $<k^{in}> = \frac{1}{N} \sum^N_{i = 1} k^{in}_i = <k^{out}> = \frac{1}{N} \sum^N_{i = 1} k^{out}_i = L/N$ fordi der ikke er dobbelt-tælling.

- *Degree distribution:* = p_{k}  giver sandsynligheden for at en given node har degree k. $p_k$ er altså en probability, i.e. $\sum^\infty_{k=1} p_k = 1$. I et netværk med N noder er degree fordelingen det normaliserede histogrm $p_k = \frac{N_k}{N}$, hvor $N_k$ er antallet af noder med degree = k. Simpelt. Antallet af noder med k-degre kan altså også fås ved $N_k = N p_k$ (igen, simpelt nok). Degree distribution er centralt i network science. Mange udregninger kræver at vi kender p_k. Fx: <k> kan skrives $\sum^{\infty}_{k = 0} k p_k$. Den præcise funktionelle form af p_k beskriver desuden ting som robusthed, spread of vira, etc.

- *Adjacency matrix:* er en måde at repræsentere et netværk numerisk. For et netværk med N nod reder N rækker og N kolonner. Adjacency matricen A har $A_{ij} = 1$ hvis der er et link fra j til i. Læg mærke til at det er et link fra kolonne til række. $A_{ij} = 0$ hvis der ikke er et link. En undirected graf har to elementer per forbindelse ($A_{ij} = A_{ij}$). Den er altså symmetrisk. I vægtede netvlrj er $A_{ij}$ linket fra  $j$ til $i$ og $A_{ji}$ er linket fra $i$ til $j$. 

- *Adjacency matrix and degree:* for et undirected netværk er en nodes degree enten kolonne eller row sums: $k_i = \sum^{N}_{j = 1} A_{ji} = \sum^N_{i = 1} A_{ji}$. For directed netwoks er row og column sums hhv ingoing eller outgoing degrees: $$ k^{in}_i \sum^N_{j = 1} A_{ij} \text{ , } k^{out}_i \sum^N_{j=1} A_{ji} $$

- *Real networks are sparse:* Antallet af noder og links varierer meget i reallife netværk. Teoretisk er antallet af links mellem L = 0 og L = $L_{max}$, hvor $L_{max} = \frac{N(N-1)}{2}$ er det antal af links der er i en comlete graph (dvs hvor alle noder er forbundet til alle andre noder, og hvor $A_{ii} = 0, i.e. ingen noder forbinder sig til sig selv). Det fleste netværks er sparse, dvs $L << L_{max}$.

- *Storing sparse networks:* Det betyder at de fleste adjacency matrices er sparse - i.e. mange af elementerne er bare 0'er. For meget store netævkr bliver det derfor hurtigt mere effektivt at obevarer netværker som en liste af links (i formen \{(1, 3), (2, 4), ..., etc \}) snarere end at holde den store matrix i hukkommelsen.

- *Weighted networks:* I de fleste netværk er der i praksis ikke enten et link eller ikke et link. IStedet har links forskellige styrker. Det vil sige: istedet for $A_{ij} = 1,0$ så er det $A_{ij} = w_{ij}$. Det kan dog ofte lade sig gøre at approximate det vgtede netvrk med et binært netværk, der typisk er nemmere at analysere.

- *Metcalfe's law:* "et netværks værdi = N^2". Jo flere der bruger et netværk, desto mere er det værd. Loven er baseret på $L_{max} = N(N-1) / 2$. Når N = 10, så er Lmax = 45. Når N er 20, så er Lmax = 190. Dette er er network externalities. To issues begrænser loven: 1) Fleste real world networks er sparse. Kun en lille del af muligil enks er udnyttet (dvs at den eksponentielle vækst i værdi ikke er helt sand). 2) Et link er ikke bare et link. Nogle link bruges en hel masse, mens andre links kun bruges i sjældne tilfælde.

- *Bipartite networks:*  En bipartite graph er en graph der kan deles op i to sets, U og V, hvor hvert link forbinder en U node med en V node. Et velkendt eksempel: Actors and movies. U = actors, V = movies. En projection = actors (hvor actors er forbundet til handen hvis de har vært med i samme film), en anden projection = movies (hvor movies er forbundet til hinanden, hvis de samme actors var med). Kan udviddes til flere netværk, fx triartite (recipes - ingredients - compounds).

- *Paths and distances:* Distance mellem noder i et netværk styres af deres indbyrdes "path length". En "path" går langs links i et netværk. Den længde er hvor mange links den strllkker sig over. En stig mellem node $i_0$ og $i_n$ er skrevet gennem en ordnet liste af n links: $P = \{ (i_0, i_1), (i_1, i_2), ..., ($_{n - 1}, i_n \}$.

- *Shortest path and distance:* Distancen mellem node 1 og 3 er den korteste sti i mellem de to noder og noteres typisk $d_{1,3}$. I et undirected netværk er $d_{ij} = d_{ji}$. I et directed network er det typisk ikke tilfældet.

- *Average path length:* <d> = average af alle shortest paths.

- *Cycle:* stig med samme start og slut node.

- *Eulerian path:* sti der går over hver link præcis en gang.

- *Hamiltonian path:* en stig der besøger hver node præcis en gang.

- *Number of shortest paths between nodes:* Antallet af shortest paths mellem to noder, $N_{ij}$, og deres længde, $d_{ij}$, kan findes direkte i $A_{ij}$. Hvis $A_{ij} = 1$, så er dij = 1. His $A_{ik}A_{jk} = 1$ så r dij = 2. $$ N^{(2)}_{ij} = \sum^N_{k = 1} A_{ik} A_{jk}  A^2_{ij} $$

- *dij = d:* hvis der er en sti med længden d mellem i og j, så er $A_{ik} ... A_{lj} = 1$. Antallat af ....

- *Breadth-first-search:* Dette er dog besværligt for store netværks. I stedet bruges BFS algoritmen. BFS kan sammenlignes med at lave ringe i vandet. Man bliver ved med at lave nye til man ammer target noden. Antallet af "etaer" med at lave ringe = d. Eksempel: start ved node 0. De noder der er forbundet med 0 hedder nu en. Alle noder (som ikke har et label endnu) som er forbundet til 1ere hedder 2. Og så videre.

- *Average path length in directed network:* <d> for directed network: $$ d = \frac{1}{N(N-1)} \sum_{i,j = 1,N; i \neq j} d_{i,j} $$

- *Connectedness:* To noder i og j er connected hvis der findes en stig i mellem dem. Det vil sige hvis $d_{ij} \neq \infty$. Et netværk er connected hvis der er en stig mllem alle node-ar. Det er disonnecte, hvis der er mindst et ar ij som har $d_{ij]} = \infty$. Hvis et netværk er opdet, således det er disconnected, kaldes de to unerdele for clusters eller components.

- *Component:* En comonent er et ub netowrk, hvor der er en path mellem alle noder, men man ikke kan tiløje flere noder til dem, så de stadig vil have samme egenskaber.

- *Bridge:* Et link der forbinder to comonents er en bridge. Generelt, så er en bridge et link, som hvis det bliver fjernet bertyder at netværket bliver disconnected.

- *Find ud af om network er connected:* Lav BFS. Hvis antallet af labelled nodes  N (i.e. alle) så er netværket connected. Hvis ikke, så gå til en unlabelled node, og start BFS igen. Gentag til der ikke er flere unlabelled noder. De antal gange der startes forfra = antallet af components.

- *Clustering coefficient:* Clustering coefficient viser hvor meget naboer til en given node linker til hinanden.

- *Local clustering coefficient:*  For en node i med degree $k_i$ så er local clustering coefficient defineret som $$ C_i = \frac{2L_i}{k_i(k_i-1)} $$ hvor L_i er antallet af links mellem de k_i naboer til node i har. Det er altså normaliseret til mellem  og 1. 0 = ingen naboer har et links til en anden nabo. 1 = naboerne til i udgær en komlet graph -> alle linker direkte til hinanden.

- *Fortolkning af C_i:* C_i er altså sansynligheden for at to naboer til i er forbundet. Ci er derved den lokale link-density.

- *Average clustering coefficient:* fanger i hviklen hrad et helt netværk er clustered. $$ <c> = \frac{1}{N} \sum^N_{i = 1} c_i $$ Dette er for undirected networks. En anden fortolkning af C_i er antallet af lukkede trekanter som i deltager i.

- *Global clustering coefficient:* $C_\Delta$ = $$ \frac{3 \times \text{number of triangles}}{\text{number of connected triplets}} $$ En connected triplet er et ordnet st af 3 noder ABC, sådan at A forbindes til B og B forbindes til C. En ABC trekant er derved lavet ud af 3 triplets: ABC, BCA, CAB. In contrast, hvis B er forbundet til A og C men A ikke er til C, så er der en åben triplet ABC. Konstanten 3 i formlen referere til at hver trekant er talt gange i triplets. 

