Network Science/notes/network-notes.tex

\section{Random Networks}
\label{sec:org83ae6c8}
\subsection{The Random Network Model}
\label{sec:org8bdf38b}
(Hedder også Erods-Renyi network.) De fleste netværk vi møder i verdne er ikke-ordnede, men rodede. De ligner lidt random networks. Random Netowrk modeller undersøger virkerlige netowrk egenskaber gennem kunstige netværk, der er truly random. Her placeres links mellem noder tilfældigt. 

Typisk bruges en af to definitioner af random netowrks: 
\begin{itemize}
\item G(N, L) model: N noder er forbundet gennem L tilfældigt placerede links.
\item G(N, P) model: N noder. Hvert node-par har P sansynlighed for at have et link i mellem sig.
\end{itemize}

Altså, G(N, L) fixer antallet af links, og G(N, P) fixer sandsynligheden for at der et link.  I G(N, L) modellen er nodernes avg. links: \(<k> = 2L/N\). Andre netowrk egenskaber er dog nemmere udregne i G(N, P). 

I G(N, P) så starter vi med N isolerede noder. Så vælges et node par, og et tilfældigt tal mellem 0 og 1. Hvis tallet er større en p, såsættes et link. Dette gentages N(N-1)/2 gange (i.e. for alle parrene).

\subsection{The Number of Links}
\label{sec:org2f378fe}
Sandsynligheden for at et random netowrk har L links er produkt af tre ting. 

\begin{enumerate}
\item Sandsynligheden for at L af de \(\frac{N(N-1)}{2}\) er success'er. Dvs \(p^{L}\).
\item Sandsynligheden for at resten af links ikke er en success. Altså sandsynligheden for at der er \(\frac{N(N-1)}{2} - L\) failures. Altså: $$(1 - p)^{N(N-1)/2 - L}$$
\item en kombinatorisk faktor som tæller hvor mange måder vi kan placere L-links mellem \(\frac{N(N-1)}{2}\) par: $$ \binom{\frac{N(N-1)}{2}}{L} $$
\end{enumerate}

Altså: \textbf{sandsynligheden for at der er L links}, \(p_{L}\), kan skrives som

$$ p_{L} = \binom{\frac{N(N-1)}{2}}{L} p^{L} (1 - p)^{\frac{N(N-1)}{2} - L} $$

Dette er en binomial distribution. Det \textbf{forventede antal af links} er derved: 

$$ <L> = \sum^{N(N-1)/2}_{L = 0} L p_{L} = p(\frac{N(N-1)}{2}) = p \text{ gange antallet af forsøg} $$

\textbf{Gennemsnits degree er således} bare udtrykt ved \(<k> = p(N-1)\). Her er \(p\) = sandsynligheden for at noden er forbundet med en given anden node, og N-1 erdet højeste antal af noder man kan være forbundet med (fordi man ikke kan være forbundet med sig selv).

\textbf{Binomial distribution: mean and degree:} En binomial distribution giver os sandsynligheden for x antal af successer i N udahængige experimenter, hvor der er to mulige outcomes (success eller failure). Success har sandsynligheden \(p\) og failure har sandsynligheden \(1 - p\).

\begin{itemize}
\item Sandsynligheden for x successer i N trials. $$ p_{x} = \binom{N}{x} p^{x} (1 - N)^{N-x} $$

\item Mean (first moment) antal af successer: $$ <x> = \sum^{N}_{x = 0} x p_{x} = Np $$

\item Second moment: $$ <x^2> = \sum^{N}_{x=0} x^2 p_{x} = p(1-p)N+p^2N^2$$

\item Standard deviation: $$ \sigma_{x} = (<x^2> - <x>^2)^{1/2} = (p(1-p)^N)^{1/2} $$
\end{itemize}

\subsection{Degree distribution}
\label{sec:org2d69a41}
\textbf{Binomial distribution:} I en given instance af et netværk har nogle noder mange likns og nogle noder har færre. Denne fordeling fanges af \(p_{k}\), degree distriubtionen (i.e. sansynligheden for at en given noder har \(k\) links).

Sandsynligheden for at en node \(i\) har præcis \(k\) links er produkt af tre termer: 

\begin{enumerate}
\item Sandsynligheden for at noden har \(k\) links: \(p^k\).
\item Sandsynlighed for at de resterende links ikke er der (dvs N-1-k links mangler): \((1 - p)^{N - 1 - k}\).
\item Antallat af måder man kan have \(k\) links fra N - 1 mulige: \(\binom{N-1}{k}\). Altså bare den binomiale fordeling $$ p_{k} = \binom{N - 1}{k} p^{k} (1-p)^{N - 1 - k} $$
\end{enumerate}

\textbf{Poisson distribution:} De fleste real world networks er sparse. Det betyder at \(<k> << N\).  Her er fordelingen godt approximmeret af Poisson fordelingen: $$ p_{k} = e^{-<k>} \frac{<k>^{k}}{k!} $$

Det den binomiale fordeling og Poisson fordelingen beskriver har den samme kvanitet og de har derfor samme egenskaber.
\begin{itemize}
\item De peaker begge omkring <k>. Når p stiger, så bliver netværket mere dense, og <k> stiger og bevæger sig til højre. Bredden af fordelingen styres af p eller <k>. Desto mere dense, desto bredere fordeling.
\end{itemize}

Når vi bruger poisson, så skal vi huske på at:
\begin{itemize}
\item Den præcise fordeling er binomial. Poisson er altså kun en approx når <k> << N.
\item Fordelingen ved Poisson er at <k> og <k\textsuperscript{2}> og \(\sigma_k\) har en simplere form for de kun afhænger af <k>.
\item Poisson bruger ikke explicit N og derfor skelnes ikke mellem netværk af forskellige størrelse, så længe <k> er den samme.
\end{itemize}

For små netværk (N = 10\textsuperscript{2}) er degree distribution ikke kun approx af Poisson. For N = 10\textsuperscript{3}, 10\textsuperscript{4}, så er den indistinguishable fra Poisson. 

\subsection{Real networks are not Poisson}
\label{sec:org4066fa0}
Hvor stor er forskellen på noden med færrest og flest links? Hvis hvert menneske kender ca 1000 mennesker, og der er et samfund med N = 7 * 10\textsuperscript{9} menesker, såkan vi udlede (se advanced topics) følgende:
\begin{itemize}
\item den mest forbundne person forventes at have ca \(k_{max} = 1.185\) venner (i et random network).
\item Den mindst forbundne node, \(k_{min} = 816\).
\item \(\sigma_{k}\) (dispersion) \(= <k>^{1/2}\). For <k> = 1000, så er dispersion = 31.62. Altså vil de fleste menneske have mellem 968 og 1032 venner = meget smal interval.
\end{itemize}

Dette er et vigtig resultat: i random networks er de fleste noder i nærgeden af <k>. Dette er i konflikt med de fleste virkelige netværk. Her er der mange outliers (meget eller meget lidt forbundne noder). 

\textbf{Hvorfor mangler hubs?:} 1/k! termet i poisson fordelingen sænker sandsynligheden for store degree-noder meget. Sterling-aproximationen $$ k! \approx (\sqrt{2 \pi k}) (\frac{k}{e})^{k} $$ tillader os as omskrive poisson til 
$$ p_{k} = \frac{e^{-<k>}}{\sqrt{2 \pi k}} ) (\frac{e <k>}{k})^{k} $$ 

Det betyder at for noder med k > e <k> så er terminen i parents mindre end 1, hvilket betyder at for store k, så er begge k-afhængige terminer stlrkrt faldende som k stiger. Det vil sige at i et random netowrk falder sandsynligheden for høje k noder hurtigere end eksponentielt.
