Network Science/notes/network-notes.tex

\subsection{The evolution of a random network}
\label{sec:org2a04ca5}
I vin-concktail party eksemplet snakker folk sammen, som festen forløber. Det vil sige at snakke-links kommer i løbet af aftenen. Det er det samme som i G(N, P) modelelen at øge o langsomt. Det har stor betydning for netværkets udformning. Vi kan se dette ed at kigge på største cluster i netværket, \(N_G\), som <k> ændres.  

\begin{itemize}
\item For p = 0 har vi <k> = 0, N\textsubscript{G} = 1, og N\textsubscript{G}/N = 0 for høje N.
\item For P = 1, <k> = N-1, N\textsubscript{G} = N, N\textsubscript{G}/N = 1.
\end{itemize}

Denne process er ikke gradvis. For små <k> så er N\textsubscript{G}/N = 0 for store N. Så snart <k> overstiger en kritisk værdi så stiger N\textsubscript{G}/N og signalere at en stor cluster fremkommer (giant component).

Erdos + Renyi forudsagde at betingelsen for at en gian component fremkommer er <k> = 1. Altså skal der i gennemsnit være et link per node, før der komme en gian component. 

Det vil altså sige at vi kan udtrykke den \(p\) nødvendigt for en giant component ved at finde sandsynligheden for <k> >= 1. Fordi vi ved at \(<k> = \frac{2<L>}{N} = p(N-1)\) så kan vi skrive \(p_{C} \frac{1}{N-1} \approx 1/N\). Det vil altså sige at den link-probaiblity der er nødvendig for at få en giant component falder som N stiger. Det punkt når der emerger en giant component er kun en af flere topologiske regimer vi kan identificere. 

\begin{enumerate}
\item \textbf{Sub-critical regime: 0 < <k> < 1. (P < 1/N):} Når <k> = 0 er der ingen links. Som <k> stiger tilføjes N<k> links. Giver <k> < 1 er der nu små clusters. Den relative størrelse af den største cluster er stadig N\textsubscript{G}/N = 0. Når <k> < 1 så er den største cluster et træ med størrelse \(N_G \approx ln N\), det vil sige at den vokser meget langsommere end netvækerts størrelse. Altså: i sub-critical regime er der mange små clusters, hvis størrelse følger en exponentiel distribution.
\item \textbf{Critical point: <k> = 1 (p = 1/N):} Det kritiske punkt er der hvor netværker går fra ikke at have en critical component til at have en. (fra <k> < 1 til <k> > 1). Her er den relative størrelse (N\textsubscript{G}/N) stadig 0. Størrelsen af største component = \(N_G \approx N^{2/3}\). N\textsubscript{G} vokser altså stadig langsommere end netværket så den relative størrelse falder som \(N_G/N \approx N^{1/3}\) når N -> \(\infty\). I absolutte taler er der dog et stort  hop i størrelsen af N\textsubscript{G}. Nu er der altså flere små components. Fleste har en tree form, få er måske loops. Størrelsen følger en power-law fordeling. Egenskaber for netværk ved critical point ligner systemer der undergår en phase transition.
\item \textbf{Supercritical regime: <k> > 1 (p > 1/N):} Dette regime er det der har mest relevans for virkelige netværk. Nu har vi en component der ligner et netævkr. I omegnen af critical point er \(\frac{N_G}{N} \approx <k> - 1\) eller \(N_G \approx (p - p_{C}\) hvor p\textsubscript{C} er givet ved 1/(N-1). Altså så indeholder N\textsubscript{G} en finit fraction af noderne (og ikke = 0 som før). Desto længere vi kommer fra ciritcal point, desto højere fraktion. For store <k> gælder \(N_G = (p - p_C)N\) ikke. Her er forholdet mellem N\textsubscript{G} og <k> ikke-linært. Nu er der en del isolerede components og en giant. Dsse små er tree-formede, giant inderholder loops og cycles. Supercritical regime fortsætter indtil alle components er "opslugte" af giant comp.
\item \textbf{Connected regime: <k> > ln N (p > ln N / N):} for store nok p absorberer giant component alle de andre. I.e. \(N_G \approx N\). <k> = ln N. Netværket er dog stadig ret spare, da ln N / N -> 0 når N -> \(\infty\). Netværket er en complete graph ved <k> = N-1. De isolerede noder og minicomponent collapser altså sammen til en giant component gennem en phase transition som <k> stiger.
\end{enumerate}

\subsection{Real networks are supercritical}
\label{sec:org960bada}
Fra random networks er der to forudsigelser som er direkte relevante for virkelige netværk. 

\begin{enumerate}
\item Som <k> stiger over 1, så skal der komme en giant component. Dvs for <k> > 1 begynder noderne at organisere sig i en netværks form som vi kender det.
\item For <k> > ln N er alle komonenter absoreret af giant component. = single connected network.
\end{enumerate}

Gælder disse tre forudsigelser så for ægte netværk? Dette kan testes empirisk.

Virkelige netværk overskrider <k> = 1 grænsen markant. Fx: Science collaboration = 8.08, internettet = 6.34, actor network = 87.71, protein interactions = 2.90. 

Vi forventer at der er en giant component for <k> > 1 og et connected network for <k> > ln N. Det gælder dog for ægte netværk at der er en connected netowkr langt før <k> ln N. De fleste ægte netværk overholder ikke <k> > ln N, og er derfor i supercritical fase. De burde derfor have små, disconnected networks og en enkelt giant. Men de har de ofte ikke. Det er altså ikke alle dele af ægte netværk der er godt approximeret af Erdos-Renyi netværk. 

\subsection{Small Worlds}
\label{sec:org4d83d35}
Small World property = seperation mellem noder (stien) er overraskende lav (tænk 6 degrees of seperation). 
\begin{enumerate}
\item Hvad betyder det at en afstand er "lille"?
\item Hvorfor er afstanden kort?
\end{enumerate}

Hvis et netværk ahr average degree <k> så har en node i gennemsnit:
\begin{itemize}
\item <k> noder ved distancen 1 (et hop)
\item <k>\textsuperscript{2} noder ved distancen 2 (et hop)
\item <k>\textsuperscript{3} noder ved distancen 3 (et hop)
\item <k>\textsuperscript{d} noder ved distancen d (et hop)
\end{itemize}

Det vil sige at hvis der i et social netværtk er <k> = 1000, så er der 10\textsuperscript{6} ved 3 degree distance. 100\textsuperscript{3} = mia. 

Mere præcist så er antallet af noder distance d fra en en node (hvis der ikke tages notits af overlap og redundancy) = $$ N(d) \approx 1 + <k> + <k>^2 + ... + <k>^d = \frac{<k>^{d+1} -1}{<k> - 1} $$

N(d) kan ikke være større end N, så vi kan identifieres \(d_{max}\), eller netværkets diameter ved \(N_{d_{max}} \appox N\). Ved at antage at <k> >> 1 kan vi fjerne -1 fra formlen (fordi den ikke giver praktisk betydning) denom og nom. Vi får derved: \(<k>^{d_{max}} \appox N\), diameteren er deved \(d_{max} = \frac{ln N}{ln <k>}\) som er den matemtiske formulation af small world fænomenet. 


Der er dog en vigtig hage. I de fleste real world netværk er \(\frac{ln N}{ln <k>}\) en bedre approximation af <d>, dvs afstand mellem to tilfældigt valgte noder. Dette er fordi \(d_{max}\) er domineret af få ekstreme stier, og <d< er gennemnsittet af alle stier. Typisk er small world phenom altså defineret ved 

$$ <d> = \frac{ln N}{ln <k>} $$

der beskriver sammenhængen mellem average degree og netværkets størrelse.

\begin{itemize}
\item Generelt geælder det at ln N << N og distancen er derved magnitudes mindre end N. Ved "small" menes dermed at avg path length afhænger logaritmisk på system size
\item \(\frac{1}{ln <k>}\) termet betyder at distancen er kortere i mere dense netværk
\item I virkewlige netværk er der dog systematisk korrektioner ved approximationen af <d>, fordi antallet af noder ved distancen d > <d> falder meget hurtigt. Det vil sige at der er meget få noder længere væk en gennemsnit (fordelingen er meget smal).
\end{itemize}

Ud fra disse beregninger er <d> world social network ca 3.3. Altså meget mindre end 6.
