Network Science/notes/network-notes.tex

\subsection{Clustering Coefficient}
\label{sec:org838e965}
Local clustering coefficient fortæller om forholdet mellem en nodes naboer. Er de forbundet til hinanden?

\begin{itemize}
\item Local clustering coefficient = \(C_i\)
\item C\textsubscript{i} = 0, ingen links mellem en nodes naboer.
\item C\textsubscript{i} = 1, alle en nodes naboer er forbundet til hinanden.
\end{itemize}

For at udregne C\textsubscript{i} skal vi estimere det forventede antal links L\textsubscript{i} mellem en nodes k\textsubscript{i} naboer. Sandsybligheden for et link mellem to noder er \(p\). Siden der \(\frac{k_i(k_i - 1}{2}\) mulige links, så er den forventede L\textsubscript{i}: $$ <L_i> = p(\frac{k_i(k_i - 1}{2}) $$.

C\textsubscript{i} kan således findes ved: $$ C_i = \frac{2 <L_i>}{k_i (k_i - 1) = p = \frac{<k>}{N}} $$

Denne laver to forudsigelser: 
\begin{enumerate}
\item For en fast <k> så betyder større N at C\textsubscript{i} bliver mindre. <c> følger også formlen.
\item Local clustering coefficient er uafhængig af degree for noder.
\end{enumerate}

Når disse to predictions testes mod virkelige netværk finder man at den ikke godt beskriver clustering i dem. <C> / <k> er stort set uafhængig af N i ægte netværk. Det er imod forudsigelsen om \(C_i = p = \frac{<k>}{N}\).

C er afhængig af k\textsubscript{o}- C(k) falder med degree. Dette er imod forudsigelen også.

Virkelige netværk har altså højere clustering end forventen under random netværk modellen.

\subsection{Summary}
\label{sec:orgcfe2668}
Er virkelige netværk Random Networks? Nej. De fejler på en række kvantitative mål. 

\begin{enumerate}
\item \textbf{Degree distribution:} Random netværk har nn binomial fordeling, som er godt approximeret af Poisson (når <k> << N). Poisson fejler dog i at forklare degree distribution. Virkelige netværk har noder der meget mere forbundne end under Poisson (altså, der er meget flere ekstreme værdier, i.e. fordelingen af bredere).
\item \textbf{Connectedness:} I en random network model fordusiges det at for <k> > 1 skal der være en giant component. Dette gælder for de fleste virkeligt netværk. Det gølder dog ikke at de først er connected når <k> > ln N. I virkelige netværk sker det langt før.
\item \textbf{Average path length:} Random network theory forudsiger at path length følger \(<d> \approx \frac{ln N}{ln <k>}\). Dette passer meget godt med empiriske observationer.
\item \textbf{Clustering coefficient:} I et random netværk er clustering coefficient uafhængig af en nodes degree, og acA afhænger af system størrelsen (1/N). Empirisk ser det modsat ud til at der for virkelige netævkr gælder at C(k) falder som en nodes degrees stiger, og er stort set uafhængigt af N.
\end{enumerate}

\textbf{Hvorfor overhovedet bruge Random Networks når de kun er gode til at beskrve small world?} Fordi hver ghang vi observerer en egenskab ved et netværk skal ve teste om den egenskab ved et netævrket kan være opstået tilfældigt. Her er random netværk modellen referencen. Det er altså en slags null-model.

\subsection{Homework [0/6]}
\label{sec:org231d156}
\subsubsection{{\bfseries\sffamily TODO} Erdős-Rényi Networks}
\label{sec:orge88f88b}
Consider an Erdős-Rényi network with N = 3,000 nodes, connected to each other with probability y\(p = 10^{–3}\).
\begin{enumerate}
\item What is the expected number of links, <L>?
\item In which regime is the network?
\item Given the linking probability \(p = 10^{–3}\), calculate the number of nodes \(N^{cr}\) so that the network has only one component.
\item For the network in (3), calculate the average degree <\$k\textsuperscript{cr}> and the average distance between two randomly chosen nodes <d>.
\item Calculate the degree distribution \(p_k\) of this network (approximate with a Poisson degree distribution).

\item <L> findes ved \(p\) gange antallet af trials. Altså: \$\$ <L> = 10\textsuperscript{-3} (\frac{3000 (3000 - 1)}{2}) = 4498.5
\item For at finde det regime som netværket ligger i, skal vi kigge på <k> (avg degree). For et random network gælder det \(<k> = p(N-1)\), altså: \(10^{-3}(3000-1) = 2.999\). Det betyder at vi er i supercritical eller connected (fordi <k> > 1). Nu skal testes om <k> > ln N. ln(3000) = ca. 8. Altså <k> < ln N. Derfor er vi i supercritical.
\item For at kun have en component skal netwærket være connected. Det vil sige at vi skal være i det sidste regime. Altså: <k> > ln N. Vi kan derfor bare solve for N: \(p(N - 1) = ln N\) eller \(p > ln N/N\). Svaret er ca 9120 noder.
\item Vi har et netværk på 9120 noder og en p på 0.001. Vi kan finde <k> ved p(N-1). Altså: 0.001(9120 - 1) = 9.119. Vi ved at når <k> >> 1 så er <d> = \(\frac{ln N}{ln <k>}\). Altså: \(<d> = \frac{ln 9120}{ln 9.119} = 4.125\).
\item 
\end{enumerate}

\subsubsection{{\bfseries\sffamily TODO} Generating Erdős-Rényi Networks}
\label{sec:orgc3c90ff}
\begin{enumerate}
\item Relying on the G(N, p) model, generate with a computer three networks with N = 500 nodes and average degree (a) <k> = 0.8, (b) <k> = 1 and (c) <k> = 8. Visualize these networks.
\end{enumerate}

\subsubsection{{\bfseries\sffamily TODO} Circle Network}
\label{sec:org42cdd8a}
\begin{enumerate}
\item Consider a network with N nodes placed on a circle, so that each node connects to m neighbors on either side (consequently each node has degree 2m). Image 3.14(a) shows an example of such a network with m = 2 and N = 20. Calculate the average clustering coefficient <C> of this network and the average shortest path <d>. For simplicity assume that N and m are chosen such that (n-1)/2m is an integer. What happens to <C> if N >> 1? And what happens to <d>?
\end{enumerate}

\subsubsection{{\bfseries\sffamily TODO} Cayley Tree}
\label{sec:orgd49115f}
A Cayley tree is a symmetric tree, constructed starting from a central node of degree k. Each node at distance d from the central node has degree k, until we reach the nodes at distance P that have degree one and are called leaves (see Image 3.16 for a Cayley tree with k = 3 and P = 5.)

\begin{enumerate}
\item Calculate the number of nodes reachable in t steps from the central node.
\item Calculate the degree distribution of the network.
\item Calculate the diameter dmax.
\item Find an expression for the diameter dmax in terms of the total number of nodes N.
\item Does the network display the small-world property?
\end{enumerate}

\subsubsection{{\bfseries\sffamily TODO} Snobbish Network}
\label{sec:org7e7464c}
Consider a network of N red and N blue nodes. The probability that there is a link between nodes of identical color is p and the probability that there is a link between nodes of different color is q. A network is snobbish if p › q, capturing a tendency to connect to nodes of the same color. For q = 0 the network has at least two components, containing nodes with the same color.

\begin{enumerate}
\item Calculate the average degree of the "blue" subnetwork made of only blue nodes, and the average degree in the full network.
\item Determine the minimal p and q required to have, with high probability, just one component.
\item Show that for large N even very snobbish networks (p≫q) display the small-world property.
\end{enumerate}

\subsubsection{{\bfseries\sffamily TODO} Snobbish Social Networks}
\label{sec:orgb42a490}
Consider the following variant of the model discussed above: We have a network of 2N nodes, consisting of an equal number of red and blue nodes, while an f fraction of the 2N nodes are purple. Blue and red nodes do not connect to each other (q = 0), while they connect with probability p to nodes of the same color. Purple nodes connect with the same probability p to both red and blue nodes

\begin{enumerate}
\item We call the red and blue communities interactive if a typical red node is just two steps away from a blue node and vice versa. Evaluate the fraction of purple nodes required for the communities to be interactive.
\item Comment on the size of the purple community if the average degree of the blue (or red) nodes is <k> >> 1.
\item What are the implications of this model for the structure of social (and other) networks?
\end{enumerate}

\section{The Scale-Free Property}
\label{sec:orgca28ef9}

\subsection{{\bfseries\sffamily TODO} Introduction}
\label{sec:org7b8934e}






\subsection{{\bfseries\sffamily TODO} Power Laws and Scale-Free Networks}
\label{sec:orgc13b35c}
\subsection{{\bfseries\sffamily TODO} Hubs}
\label{sec:org00cdc63}
\subsection{{\bfseries\sffamily TODO} The Meaning of Scale-Free}
\label{sec:org447f485}
\subsection{{\bfseries\sffamily TODO} Universality}
\label{sec:org34134ff}
\subsection{{\bfseries\sffamily TODO} Ultra-Small property}
\label{sec:org229c33f}
